<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Core","backend":"1d4a8b8eeeedd6074b714488e1f2af7faf0f0439a1e3deba094dc6a3b9dac5c0","plan_job_ref":"Job Tofu - Plan #25 at https://github.com/lancelot-prigent/toolbox/actions/runs/15935405301","plan_hash":"1e746ec937fb2698af1232d9a8f24463aa66d7736b0531a65db199e8cb85275b","plan_text_format":"diff","version":"2.1.0","plan_out_hash":"84e89bcd6de0a730d2671f30a7c0ede5eb06df34eacc45b8cb5cfe62dcd4ea50","closed":true} -->
OpenTofu plan for __Core__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.github_branch.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "github_branch" "main" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       ref        = (known after apply)
+       repository = "toolbox"
+       sha        = (known after apply)
    }

  # github_repository.this will be updated in-place
!~  resource "github_repository" "this" {
!~      description                 = "A monorepo template with NestJS, React, React Native, and more. Powered by Nx." -> "A monorepo template with NestJS, React, React Native, OpenTofu and more. Powered by Nx."
        id                          = "toolbox"
        name                        = "toolbox"
!~      topics                      = [
+           "open-tofu",
+           "scaleway",
#            (5 unchanged elements hidden)
        ]
#        (32 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # github_repository_ruleset.default_branch will be updated in-place
!~  resource "github_repository_ruleset" "default_branch" {
        id          = "6344556"
        name        = "default_branch_ruleset"
#        (6 unchanged attributes hidden)

!~      rules {
#            (7 unchanged attributes hidden)

+           pull_request {
+               dismiss_stale_reviews_on_push     = true
+               require_code_owner_review         = true
+               require_last_push_approval        = true
+               required_approving_review_count   = 1
+               required_review_thread_resolution = true
            }
        }

#        (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Tofu - Apply #1](https://github.com/lancelot-prigent/toolbox/actions/runs/15935457946)